{
  "companyInfo": {
    "name": "AgriTech",
    "logo": "/icon/AgriTech-Logo-_transparent_.webp",
    "slogan": "Sistema Inteligente para la Optimización Agrícola en República Dominicana"
  },
  "sections": [
    {
      "id": "project-overview",
      "title": "Visión del Proyecto",
      "icon": "FaEye",
      "content": {
        "type": "description",
        "description": "AgriTech representa una solución innovadora que integra inteligencia artificial y análisis de datos en tiempo real para transformar la agricultura dominicana. Nuestro sistema aborda los desafíos estructurales y tecnológicos que limitan la eficiencia, sostenibilidad y competitividad del sector agrícola nacional, ofreciendo herramientas accesibles para pequeños productores, estudiantes y entusiastas de la tecnología."
      }
    },
    {
      "id": "problem-context",
      "title": "Contexto del Problema",
      "icon": "FaExclamationTriangle",
      "content": {
        "type": "description",
        "description": "La agricultura en República Dominicana enfrenta múltiples desafíos: uso de prácticas tradicionales insuficientes, limitada incorporación de tecnologías avanzadas, y falta de acceso a herramientas de análisis de datos. Según la FAO, las tecnologías digitales pueden aumentar la productividad agrícola entre 20-30%, pero en el contexto dominicano estas herramientas se aplican de manera limitada, especialmente entre pequeños productores."
      }
    },
    {
      "id": "general-objective",
      "title": "Objetivo General",
      "icon": "FaTrophy",
      "content": {
        "type": "description",
        "description": "Desarrollar e implementar una plataforma basada en inteligencia artificial que optimice la producción agrícola mediante el análisis de datos en tiempo real, permitiendo mejorar la eficiencia y sostenibilidad del sector agrícola dominicano."
      }
    },
    {
      "id": "specific-objectives",
      "title": "Objetivos Específicos",
      "icon": "FaClipboardList",
      "content": {
        "type": "items",
        "items": [
          {
            "title": "Integración de Tecnologías Avanzadas",
            "icon": "FaMicrochip",
            "description": "Implementar modelos de aprendizaje automático y sensores especializados para recopilar y analizar datos sobre el suelo, clima y detección temprana de plagas y enfermedades."
          },
          {
            "title": "Optimización del Uso de Recursos Agrícolas",
            "icon": "FaTint",
            "description": "Reducir el uso excesivo de fertilizantes, agua y pesticidas mediante recomendaciones personalizadas basadas en datos precisos y análisis predictivo."
          },
          {
            "title": "Prevención de Pérdidas por Plagas y Enfermedades",
            "icon": "FaShieldAlt",
            "description": "Utilizar inteligencia artificial para identificar y alertar sobre posibles amenazas a los cultivos antes de que causen daños significativos a la producción."
          },
          {
            "title": "Accesibilidad para Distintos Tipos de Productores",
            "icon": "FaUsers",
            "description": "Diseñar un sistema intuitivo y adaptable que pueda ser utilizado por pequeños agricultores, estudiantes y entusiastas tecnológicos en zonas rurales y urbanas."
          },
          {
            "title": "Promoción de la Sostenibilidad Agrícola",
            "icon": "FaLeaf",
            "description": "Fomentar prácticas de cultivo más responsables que minimicen el impacto ambiental y mejoren la seguridad alimentaria a nivel nacional."
          }
        ]
      }
    },
    {
      "id": "methodology",
      "title": "Metodología del Proyecto",
      "icon": "FaCogs",
      "content": {
        "type": "items",
        "items": [
          {
            "title": "Enfoque Cuantitativo No Experimental",
            "icon": "FaChartBar",
            "description": "Investigación descriptiva y correlacional que analiza la implementación de IA en agricultura sin manipular variables, observando el fenómeno en su contexto natural."
          },
          {
            "title": "Análisis de Datos en Tiempo Real",
            "icon": "FaClock",
            "description": "Recopilación y procesamiento continuo de información climática, del suelo y de cultivos para generar recomendaciones inmediatas y precisas."
          },
          {
            "title": "Validación con Usuarios Reales",
            "icon": "FaCheckCircle",
            "description": "Evaluación con una muestra de 50-70 participantes en la región del Cibao, incluyendo agricultores, agrónomos y representantes institucionales."
          },
          {
            "title": "Desarrollo Iterativo",
            "icon": "FaRecycle",
            "description": "Proceso de mejora continua basado en retroalimentación de usuarios y análisis de resultados para optimizar la plataforma."
          }
        ]
      }
    },
    {
      "id": "theoretical-foundations",
      "title": "Fundamentos Teóricos",
      "icon": "FaGraduationCap",
      "content": {
        "type": "items",
        "items": [
          {
            "title": "Agricultura de Precisión",
            "icon": "FaMapMarkerAlt",
            "description": "Uso de tecnologías GPS, sensores y análisis de datos para optimizar el manejo variable de parcelas agrícolas según sus características específicas."
          },
          {
            "title": "Agricultura 4.0",
            "icon": "FaRobot",
            "description": "Integración de Internet de las Cosas (IoT), inteligencia artificial, drones y robótica para la gestión automatizada y precisa de procesos productivos."
          },
          {
            "title": "Sistemas Complejos",
            "icon": "FaProjectDiagram",
            "description": "Enfoque interdisciplinario que considera la agricultura como un sistema donde convergen múltiples variables: clima, suelo, cultivos y factores humanos."
          },
          {
            "title": "Aprendizaje Automático",
            "icon": "FaBrain",
            "description": "Aplicación de algoritmos que aprenden de datos históricos para predecir condiciones meteorológicas, identificar plagas y recomendar prácticas de cultivo."
          }
        ]
      }
    },
    {
      "id": "expected-impact",
      "title": "Impacto Esperado",
      "icon": "FaRocket",
      "content": {
        "type": "items",
        "items": [
          {
            "title": "Transformación Digital del Sector",
            "icon": "FaDigitalTachograph",
            "description": "Reducir la brecha tecnológica en el ámbito agrícola dominicano, especialmente entre pequeños productores y comunidades rurales."
          },
          {
            "title": "Mejora en la Productividad",
            "icon": "FaArrowUp",
            "description": "Incremento esperado del 20-30% en productividad agrícola mediante optimización de recursos y toma de decisiones basada en datos."
          },
          {
            "title": "Sostenibilidad Ambiental",
            "icon": "FaGlobeAmericas",
            "description": "Reducción del impacto ambiental a través del uso eficiente de agua, fertilizantes y pesticidas, promoviendo prácticas agrícolas responsables."
          },
          {
            "title": "Desarrollo Social y Económico",
            "icon": "FaHandsHelping",
            "description": "Contribuir al desarrollo económico rural, mejorar las condiciones laborales y fomentar la inclusión tecnológica en zonas agrícolas."
          }
        ]
      }
    },
    {
      "id": "scope-limitations",
      "title": "Alcance y Delimitaciones",
      "icon": "FaMapMarkedAlt",
      "content": {
        "type": "items",
        "items": [
          {
            "title": "Delimitación Espacial",
            "icon": "FaMap",
            "description": "Enfocado en la región del Cibao, especialmente provincias como Monseñor Nouel y La Vega, reconocidas por su diversidad de cultivos y actividad de pequeños productores."
          },
          {
            "title": "Delimitación Temporal",
            "icon": "FaCalendarAlt",
            "description": "Desarrollo del proyecto enmarcado en el período 2023-2025, permitiendo observar cambios sustanciales en productividad y procesos de toma de decisiones."
          },
          {
            "title": "Delimitación Conceptual",
            "icon": "FaBookOpen",
            "description": "Centrado específicamente en agricultura de precisión con inteligencia artificial, excluyendo ingeniería genética, biotecnología y diseño de maquinaria."
          },
          {
            "title": "Limitaciones Técnicas",
            "icon": "FaTools",
            "description": "Sistema sin integración directa con otras plataformas agrícolas, enfocado en análisis de suelo, clima y plagas, sin incluir gestión financiera o de maquinaria."
          }
        ]
      }
    },
    {
      "id": "dedications-acknowledgments",
      "title": "Dedicatorias y Agradecimientos",
      "icon": "FaHeart",
      "content": {
        "type": "items",
        "items": [
          {
            "title": "Dedicatoria - Juan Manuel Flores Hernández",
            "icon": "FaUserTie",
            "description": "Dedico este proyecto a mi padre, Cesar Flores, por ser honesto y perseverante, que me ha enseñado a dar mi mayor esfuerzo y el valor del trabajo en cada momento de mi vida. A mi madre, Andrea Leticia, por darme todo el apoyo posible hasta en mis momentos difíciles, que siempre ha estado para ofrecerme su gran ternura que siempre me ha guiado a seguir delante. A mi hermano, Cesar Andrés, por haber recorrido aquellos obstáculos antes que yo, por haberme compartido desafíos y aprendizaje y por ser un gran ejemplo de dedicación e independencia. A toda mi familia y amigos, principalmente a Jeyllon Sandoval, Ismanol Ramírez, Kendra Rodríguez, Arianny Reyes y Felix Josué L. por haberme dado sus grandes apoyos, compañía, amistad y ánimo desde el inicio de esta etapa académica. Este logro también les pertenece, por caminar junto a mi hacia esta meta."
          },
          {
            "title": "Dedicatoria - Jeyllon Slon Sandoval Rosario",
            "icon": "FaUserTie",
            "description": "Primero, dedico este trabajo a ti lector, por tomarte el tiempo de leer y analizar el trabajo de mi compañero y yo, que invertimos tiempo y esfuerzo, y ahora tus haces lo mismo. Gracias, Arcenio Sandoval, por ser un padre ejemplar, el mejor de todos, porque tú me has enseñado la diferencia entre amar y querer. Decisiones complicadas, futuro incierto y el querer ser mejor, todas son cosas que me han pasado por la mente, aunque siempre he tenido claro que quiero ser y donde llegar. Gracias, María Rosario, por ser una madre dedicada, porque me has enseñado por que debemos seguir nuestros objetivos y metas. A mi hermano Arsenio Sandoval, quien muchas veces me enseña y me prepara, quien no pierde una discusión, y a quien no le llevaría un vaso de agua, pero le entregaría mi corazón si lo necesitara. ¡Gracias por ser mi hermano!"
          },
          {
            "title": "Agradecimientos - Juan Manuel Flores Hernández",
            "icon": "FaHandshake",
            "description": "A todas las personas, especialmente a mi familia por ser estar presente conmigo y por ser mi fortaleza, a mis amigos por su compañía y por el gran apoyo que me han dado cuando lo necesitaba."
          },
          {
            "title": "Agradecimientos - Jeyllon Slon Sandoval Rosario",
            "icon": "FaHandshake",
            "description": "Agradezco a quienes estuvieron, están, y estarán; amigos, familiares porque yo, Jeyllon Slon Sandoval Rosario soy la suma de cada encuentro, de cada experiencia compartida, de cada palabra, herida, abrazo y despedida. Carpe diem."
          }
        ]
      }
    }
  ]
}
